; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob6587) (:domain Depot)
(:objects
	depot0 depot1 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 distributor0)
	(clear crate9)
	(at pallet3 distributor1)
	(clear crate7)
	(at pallet4 distributor0)
	(clear crate2)
	(at pallet5 distributor1)
	(clear crate1)
	(at pallet6 depot0)
	(clear crate3)
	(at pallet7 distributor1)
	(clear crate8)
	(at truck0 depot1)
	(at truck1 distributor1)
	(at truck2 depot1)
	(at truck3 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at hoist3 distributor1)
	(available hoist3)
	(at hoist4 depot0)
	(available hoist4)
	(at hoist5 depot0)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at crate0 distributor1)
	(on crate0 pallet3)
	(at crate1 distributor1)
	(on crate1 pallet5)
	(at crate2 distributor0)
	(on crate2 pallet4)
	(at crate3 depot0)
	(on crate3 pallet6)
	(at crate4 depot1)
	(on crate4 pallet1)
	(at crate5 distributor1)
	(on crate5 crate0)
	(at crate6 distributor1)
	(on crate6 pallet7)
	(at crate7 distributor1)
	(on crate7 crate5)
	(at crate8 distributor1)
	(on crate8 crate6)
	(at crate9 distributor0)
	(on crate9 pallet2)
)

(:goal (and
		(on crate1 pallet7)
		(on crate2 pallet4)
		(on crate3 crate8)
		(on crate4 pallet0)
		(on crate6 pallet1)
		(on crate7 crate3)
		(on crate8 pallet6)
	)
)(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate4 pallet1 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet1)
   added: (lifting hoist1 crate4) (clear pallet1)
   goals met: 1 of 7
2. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 1 of 7
3. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 7
4. (unload hoist5 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 1 of 7
5. (drop hoist5 crate4 pallet0 depot0)
   deleted: (lifting hoist5 crate4) (clear pallet0)
   added: (available hoist5) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 2 of 7
6. (lift hoist7 crate1 pallet5 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist7) (on crate1 pallet5)
   added: (lifting hoist7 crate1) (clear pallet5)
   goals met: 2 of 7
7. (lift hoist3 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist3) (on crate8 crate6)
   added: (lifting hoist3 crate8) (clear crate6)
   goals met: 2 of 7
8. (load hoist3 crate8 truck1 distributor1)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck1) (available hoist3)
   goals met: 2 of 7
9. (lift hoist3 crate6 pallet7 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist3) (on crate6 pallet7)
   added: (lifting hoist3 crate6) (clear pallet7)
   goals met: 2 of 7
10. (drop hoist7 crate1 pallet7 distributor1)
   deleted: (lifting hoist7 crate1) (clear pallet7)
   added: (available hoist7) (at crate1 distributor1) (clear crate1) (on crate1 pallet7)
   goals met: 3 of 7
11. (lift hoist7 crate7 crate5 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist7) (on crate7 crate5)
   added: (lifting hoist7 crate7) (clear crate5)
   goals met: 3 of 7
12. (load hoist7 crate7 truck1 distributor1)
   deleted: (lifting hoist7 crate7)
   added: (in crate7 truck1) (available hoist7)
   goals met: 3 of 7
13. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 3 of 7
14. (unload hoist6 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist6)
   added: (lifting hoist6 crate7)
   goals met: 3 of 7
15. (unload hoist5 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 3 of 7
16. (lift hoist0 crate3 pallet6 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet6)
   added: (lifting hoist0 crate3) (clear pallet6)
   goals met: 3 of 7
17. (drop hoist5 crate8 pallet6 depot0)
   deleted: (lifting hoist5 crate8) (clear pallet6)
   added: (available hoist5) (at crate8 depot0) (clear crate8) (on crate8 pallet6)
   goals met: 4 of 7
18. (drop hoist0 crate3 crate8 depot0)
   deleted: (lifting hoist0 crate3) (clear crate8)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate8)
   goals met: 5 of 7
19. (drop hoist6 crate7 crate3 depot0)
   deleted: (lifting hoist6 crate7) (clear crate3)
   added: (available hoist6) (at crate7 depot0) (clear crate7) (on crate7 crate3)
   goals met: 6 of 7
20. (drive truck3 depot0 distributor1)
   deleted: (at truck3 depot0)
   added: (at truck3 distributor1)
   goals met: 6 of 7
21. (load hoist3 crate6 truck3 distributor1)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck3) (available hoist3)
   goals met: 6 of 7
22. (drive truck3 distributor1 depot1)
   deleted: (at truck3 distributor1)
   added: (at truck3 depot1)
   goals met: 6 of 7
23. (unload hoist1 crate6 truck3 depot1)
   deleted: (in crate6 truck3) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 6 of 7
24. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 7 of 7
